doc/BUILD/source/_static/soap_outputs/6.5.314.4301/create_package_step_7_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <package_spec>
          <expire_seconds>1500</expire_seconds>
          <display_name>package49 API test</display_name>
          <name>package49</name>
          <verify_expire_seconds>3600</verify_expire_seconds>
          <verify_group_id>293</verify_group_id>
          <command>package49 $1 $2 $3 $4 $5 $6 $7 $8</command>
          <command_timeout>9999</command_timeout>
          <parameter_definition>{"parameterType": "com.tanium.components.parameters::ParametersArray", "model": "com.tanium.components.parameters::ParametersArray", "parameters": [{"parameterType": "com.tanium.components.parameters::TextInputParameter", "validationExpressions": [{"helpString": "must be word", "flags": "", "model": "com.tanium.models::ValidationExpression", "expression": "\\S", "parameterType": "com.tanium.models::ValidationExpression"}], "helpString": "helptext", "maxChars": 10, "defaultValue": "defaulttex", "value": "defaulttex", "label": "textinput", "restrict": null, "key": "$1", "model": "com.tanium.components.parameters::TextInputParameter", "promptText": "prompttext"}, {"parameterType": "com.tanium.components.parameters::DropDownParameter", "helpString": "helptext", "defaultValue": "", "value": "v1", "label": "dropdown", "requireSelection": true, "values": ["v1", "v2"], "key": "$2", "model": "com.tanium.components.parameters::DropDownParameter", "promptText": "prompttext"}, {"parameterType": "com.tanium.components.parameters::CheckBoxParameter", "helpString": "helptext", "defaultValue": "1", "value": "1", "label": "checkbox", "key": "$3", "model": "com.tanium.components.parameters::CheckBoxParameter"}, {"parameterType": "com.tanium.components.parameters::NumericParameter", "helpString": "helptext", "defaultValue": "1", "maximum": 8, "value": "1", "label": "numeric", "stepSize": 4, "minimum": 1, "key": "$4", "model": "com.tanium.components.parameters::NumericParameter", "snapInterval": 2}, {"parameterType": "com.tanium.components.parameters::DateTimeParameter", "key": "$5", "start_date_restriction": {"parameterType": "com.tanium.models::PointInTime", "unix_time_stamp": 1414814400000, "interval": null, "intervalCount": null, "model": "com.tanium.models::PointInTime", "type": 3}, "helpString": "helptext", "defaultValue": "", "value": "", "label": "datetime", "componentType": 3, "start_time_restriction": {"parameterType": "com.tanium.models::PointInTime", "unix_time_stamp": null, "interval": 3600, "intervalCount": 5, "model": "com.tanium.models::PointInTime", "type": 1}, "end_date_restriction": {"parameterType": "com.tanium.models::PointInTime", "unix_time_stamp": 1420174800000, "interval": null, "intervalCount": null, "model": "com.tanium.models::PointInTime", "type": 3}, "end_time_restriction": {"parameterType": "com.tanium.models::PointInTime", "unix_time_stamp": 69923000, "interval": null, "intervalCount": null, "model": "com.tanium.models::PointInTime", "type": 3}, "model": "com.tanium.components.parameters::DateTimeParameter"}, {"parameterType": "com.tanium.components.parameters::DateTimeRangeParameter", "helpString": "helptext", "defaultValue": "", "default_range_start": {"parameterType": "com.tanium.models::PointInTime", "unix_time_stamp": null, "interval": 86400, "intervalCount": 1, "model": "com.tanium.models::PointInTime", "type": 2}, "value": "1417159750000|1417332550000", "label": "daterange", "default_range_end": {"parameterType": "com.tanium.models::PointInTime", "unix_time_stamp": null, "interval": 86400, "intervalCount": 1, "model": "com.tanium.models::PointInTime", "type": 1}, "key": "$6", "model": "com.tanium.components.parameters::DateTimeRangeParameter"}, {"parameterType": "com.tanium.components.parameters::ListParameter", "validationExpressions": [], "helpString": null, "defaultText": "", "defaultValue": "", "value": "", "label": "list", "restrict": null, "allowEmptyList": false, "key": "$7", "maxChars": 0, "values": [""], "model": "com.tanium.components.parameters::ListParameter", "promptText": ""}, {"parameterType": "com.tanium.components.parameters::TextAreaParameter", "validationExpressions": [{"helpString": "word", "flags": "", "model": "com.tanium.models::ValidationExpression", "expression": "\\W", "parameterType": "com.tanium.models::ValidationExpression"}], "helpString": "helptext", "maxChars": 2000, "defaultValue": "defaulttext", "heightInLines": 5, "value": "defaulttext", "label": "textarea", "restrict": null, "key": "$8", "model": "com.tanium.components.parameters::TextAreaParameter", "promptText": "prompttext"}]}</parameter_definition>
          <files>
            <file>
              <name>testing.vbs</name>
              <download_seconds>3600</download_seconds>
              <source>https://content.tanium.com/files/initialcontent/bundles/2014-10-01_11-32-15-7844/custom_tagging_-_remove_tags_[non-windows]/CustomTagRemove.sh</source>
            </file>
          </files>
          <metadata></metadata>
        </package_spec>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>